just for record

```
❯
❯ terraform apply -var-file=nutanix.tfvars
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - rancher/rancher2 in /Users/cris/temp/terraform-provider-rancher2/bin
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become
│ incompatible with published releases.
╵
data.rancher2_cloud_credential.target: Reading...
data.rancher2_node_driver.nutanix: Reading...
data.rancher2_node_driver.nutanix: Read complete after 1s [id=nutanix]
data.rancher2_cloud_credential.target: Read complete after 1s [id=cattle-global-data:cc-8jvh6]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # rancher2_cluster_v2.nutanix will be created
  + resource "rancher2_cluster_v2" "nutanix" {
      + annotations                = (known after apply)
      + cluster_registration_token = (sensitive value)
      + cluster_v1_id              = (known after apply)
      + enable_network_policy      = false
      + fleet_namespace            = "fleet-default"
      + id                         = (known after apply)
      + kube_config                = (sensitive value)
      + kubernetes_version         = "v1.34.4+rke2r1"
      + labels                     = (known after apply)
      + name                       = "tf-nutanix-e2e"
      + resource_version           = (known after apply)

      + rke_config {
          + data_directories {}
          + etcd (known after apply)
          + machine_pools {
              + cloud_credential_secret_name = "cattle-global-data:cc-8jvh6"
              + control_plane_role           = true
              + drain_before_delete          = true
              + etcd_role                    = true
              + machine_os                   = "linux"
              + name                         = "pool1"
              + paused                       = false
              + quantity                     = 1
              + worker_role                  = true

              + machine_config {
                  + kind = (known after apply)
                  + name = (known after apply)
                }
            }
          + machine_selector_config (known after apply)
          + machine_selector_files (known after apply)
          + networking (known after apply)
        }
    }

  # rancher2_machine_config_v2.nutanix will be created
  + resource "rancher2_machine_config_v2" "nutanix" {
      + annotations      = (known after apply)
      + fleet_namespace  = "fleet-default"
      + generate_name    = "nutanix-tf-"
      + id               = (known after apply)
      + kind             = (known after apply)
      + labels           = (known after apply)
      + name             = (known after apply)
      + resource_version = (known after apply)

      + nutanix_config {
          + boot_type          = "legacy"
          + cluster            = "cn-team-lab"
          + disk_size          = "0"
          + insecure           = false
          + port               = "9440"
          + timeout            = "300"
          + vm_cores           = "1"
          + vm_cpu_passthrough = false
          + vm_cpus            = "2"
          + vm_image           = "ubuntu-24.04"
          + vm_image_size      = "40"
          + vm_mem             = "4096"
          + vm_network         = [
              + "devops",
            ]
          + vm_serial_port     = false
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

rancher2_machine_config_v2.nutanix: Creating...
rancher2_machine_config_v2.nutanix: Creation complete after 1s [id=fleet-default/nc-nutanix-tf--nrdbs]
rancher2_cluster_v2.nutanix: Creating...
rancher2_cluster_v2.nutanix: Still creating... [00m10s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [00m20s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [00m30s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [00m40s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [00m50s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [01m00s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [01m10s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [01m20s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [01m30s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [01m40s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [01m50s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [02m00s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [02m10s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [02m20s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [02m30s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [02m40s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [02m50s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [03m00s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [03m10s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [03m20s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [03m30s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [03m40s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [03m50s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [04m00s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [04m10s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [04m20s elapsed]
rancher2_cluster_v2.nutanix: Still creating... [04m30s elapsed]
rancher2_cluster_v2.nutanix: Creation complete after 4m38s [id=fleet-default/tf-nutanix-e2e]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

 ~/temp/tf-rancher2-nutanix-test 
```